codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efk100.h
#define _U6MODE_UEN0_POSITION                    0x00000008
#define _U6MODE_UEN0_MASK                        0x00000100
#define _U6MODE_UEN0_LENGTH                      0x00000001

#define _U6MODE_UEN1_POSITION                    0x00000009
#define _U6MODE_UEN1_MASK                        0x00000200
#define _U6MODE_UEN1_LENGTH                      0x00000001

#define _U6MODE_USIDL_POSITION                   0x0000000D
#define _U6MODE_USIDL_MASK                       0x00002000
#define _U6MODE_USIDL_LENGTH                     0x00000001

#define _U6MODE_UARTEN_POSITION                  0x0000000F
#define _U6MODE_UARTEN_MASK                      0x00008000
#define _U6MODE_UARTEN_LENGTH                    0x00000001

#define _U6MODE_w_POSITION                       0x00000000
#define _U6MODE_w_MASK                           0xFFFFFFFF
#define _U6MODE_w_LENGTH                         0x00000020

#define _ULMMODE_STSEL_POSITION                  0x00000000
#define _ULMMODE_STSEL_MASK                      0x00000001
#define _ULMMODE_STSEL_LENGTH                    0x00000001

#define _ULMMODE_PDSEL_POSITION                  0x00000001
#define _ULMMODE_PDSEL_MASK                      0x00000006
#define _ULMMODE_PDSEL_LENGTH                    0x00000002

#define _ULMMODE_BRGH_POSITION                   0x00000003
#define _ULMMODE_BRGH_MASK                       0x00000008
#define _ULMMODE_BRGH_LENGTH                     0x00000001

#define _ULMMODE_RXINV_POSITION                  0x00000004
#define _ULMMODE_RXINV_MASK                      0x00000010
#define _ULMMODE_RXINV_LENGTH                    0x00000001

#define _ULMMODE_ABAUD_POSITION                  0x00000005
#define _ULMMODE_ABAUD_MASK                      0x00000020
#define _ULMMODE_ABAUD_LENGTH                    0x00000001

#define _ULMMODE_LPBACK_POSITION                 0x00000006
#define _ULMMODE_LPBACK_MASK                     0x00000040
#define _ULMMODE_LPBACK_LENGTH                   0x00000001

#define _ULMMODE_WAKE_POSITION                   0x00000007
#define _ULMMODE_WAKE_MASK                       0x00000080
#define _ULMMODE_WAKE_LENGTH                     0x00000001

#define _ULMMODE_UEN_POSITION                    0x00000008
#define _ULMMODE_UEN_MASK                        0x00000300
#define _ULMMODE_UEN_LENGTH                      0x00000002

#define _ULMMODE_RTSMD_POSITION                  0x0000000B
#define _ULMMODE_RTSMD_MASK                      0x00000800
#define _ULMMODE_RTSMD_LENGTH                    0x00000001

#define _ULMMODE_IREN_POSITION                   0x0000000C
#define _ULMMODE_IREN_MASK                       0x00001000
#define _ULMMODE_IREN_LENGTH                     0x00000001

#define _ULMMODE_SIDL_POSITION                   0x0000000D
#define _ULMMODE_SIDL_MASK                       0x00002000
#define _ULMMODE_SIDL_LENGTH                     0x00000001

#define _ULMMODE_ON_POSITION                     0x0000000F
#define _ULMMODE_ON_MASK                         0x00008000
#define _ULMMODE_ON_LENGTH                       0x00000001

#define _ULMMODE_PDSEL0_POSITION                 0x00000001
#define _ULMMODE_PDSEL0_MASK                     0x00000002
#define _ULMMODE_PDSEL0_LENGTH                   0x00000001

#define _ULMMODE_PDSEL1_POSITION                 0x00000002
#define _ULMMODE_PDSEL1_MASK                     0x00000004
#define _ULMMODE_PDSEL1_LENGTH                   0x00000001

#define _ULMMODE_UEN0_POSITION                   0x00000008
#define _ULMMODE_UEN0_MASK                       0x00000100
#define _ULMMODE_UEN0_LENGTH                     0x00000001

#define _ULMMODE_UEN1_POSITION                   0x00000009
#define _ULMMODE_UEN1_MASK                       0x00000200
#define _ULMMODE_UEN1_LENGTH                     0x00000001

#define _ULMMODE_USIDL_POSITION                  0x0000000D
#define _ULMMODE_USIDL_MASK                      0x00002000
#define _ULMMODE_USIDL_LENGTH                    0x00000001

#define _ULMMODE_UARTEN_POSITION                 0x0000000F
#define _ULMMODE_UARTEN_MASK                     0x00008000
#define _ULMMODE_UARTEN_LENGTH                   0x00000001

#define _ULMMODE_w_POSITION                      0x00000000
#define _ULMMODE_w_MASK                          0xFFFFFFFF
#define _ULMMODE_w_LENGTH                        0x00000020

#define _U6STA_URXDA_POSITION                    0x00000000
#define _U6STA_URXDA_MASK                        0x00000001
#define _U6STA_URXDA_LENGTH                      0x00000001

#define _U6STA_OERR_POSITION                     0x00000001
#define _U6STA_OERR_MASK                         0x00000002
#define _U6STA_OERR_LENGTH                       0x00000001

#define _U6STA_FERR_POSITION                     0x00000002
#define _U6STA_FERR_MASK                         0x00000004
#define _U6STA_FERR_LENGTH                       0x00000001

#define _U6STA_PERR_POSITION                     0x00000003
#define _U6STA_PERR_MASK                         0x00000008
#define _U6STA_PERR_LENGTH                       0x00000001

#define _U6STA_RIDLE_POSITION                    0x00000004
#define _U6STA_RIDLE_MASK                        0x00000010
#define _U6STA_RIDLE_LENGTH                      0x00000001

#define _U6STA_ADDEN_POSITION                    0x00000005
#define _U6STA_ADDEN_MASK                        0x00000020
#define _U6STA_ADDEN_LENGTH                      0x00000001

#define _U6STA_URXISEL_POSITION                  0x00000006
#define _U6STA_URXISEL_MASK                      0x000000C0
#define _U6STA_URXISEL_LENGTH                    0x00000002

#define _U6STA_TRMT_POSITION                     0x00000008
#define _U6STA_TRMT_MASK                         0x00000100
#define _U6STA_TRMT_LENGTH                       0x00000001

#define _U6STA_UTXBF_POSITION                    0x00000009
#define _U6STA_UTXBF_MASK                        0x00000200
#define _U6STA_UTXBF_LENGTH                      0x00000001

#define _U6STA_UTXEN_POSITION                    0x0000000A
#define _U6STA_UTXEN_MASK                        0x00000400
#define _U6STA_UTXEN_LENGTH                      0x00000001

#define _U6STA_UTXBRK_POSITION                   0x0000000B
#define _U6STA_UTXBRK_MASK                       0x00000800
#define _U6STA_UTXBRK_LENGTH                     0x00000001

